---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundHSS
source: html/2218cf71-8bf2-4bc4-fd90-f4d6e35b6330.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundHSS

Defines parameters for pipes known as Round HSS (HollowStructuralSection).

## Syntax (C#)
```csharp
public class StructuralSectionRoundHSS : StructuralSectionGeneralR
```